app/views/users/show.html.erb


<% @user.posts.each do |t| %>
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`user_id` = 3