app/views/posts/index.html.erb

<%=link_to post_like_path(id: t.id, post_id: t.id), method: :delete do%>
<i class="fas fa-heart"></i><%=t.likes.count%>
---
SELECT COUNT(*) FROM `likes` WHERE `likes`.`post_id` = 3

      <%=link_to post_likes_path(id: t.id, post_id: t.id), method: :post do%>
      <i class="far fa-heart"></i><%=t.likes.count%>
---
SELECT COUNT(*) FROM `likes` WHERE `likes`.`post_id` = 3