app/views/posts/show.html.erb


  <h3>いいね件数: <%= @post.likes.count %></h3>
---
SELECT COUNT(*) FROM `likes` WHERE `likes`.`post_id` = 1

    <div>
      <%= c.user.email unless c.user.blank? %>
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1