app/controllers/comments_controller.rb

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 2 LIMIT 1
INSERT INTO `comments` (`comment`, `user_id`, `post_id`, `created_at`, `updated_at`) VALUES ('あ', 3, 2, '2020-10-19 13:12:47.288580', '2020-10-19 13:12:47.288580')
---
  def create
    post = Post.find(params[:post_id])
    @comment = post.comments.build(comment_params) #commentとtweet_idの二つを代入
    @comment.user_id = current_user.id
    if @comment.save