app/controllers/likes_controller.rb

INSERT INTO `likes` (`post_id`, `user_id`, `created_at`, `updated_at`) VALUES (1, 2, '2020-09-21 11:20:38.156421', '2020-09-21 11:20:38.156421')
---
        def create
          @like = current_user.likes.create(post_id: params[:post_id])

SELECT `likes`.* FROM `likes` WHERE `likes`.`post_id` = 1 AND `likes`.`user_id` = 2 LIMIT 1
DELETE FROM `likes` WHERE `likes`.`id` = 1
---
        def destroy
          @like = Like.find_by(post_id: params[:post_id], user_id: current_user.id)
          @like.destroy