app/controllers/posts_controller.rb

INSERT INTO `posts` (`time`, `subject`, `book`, `created_at`, `updated_at`, `user_id`) VALUES ('6', '英語', '単語帳', '2020-10-14 10:45:38.394520', '2020-10-14 10:45:38.394520', 1)
---
      def create

        @post = Post.new(post_params)
        @post.user_id = current_user.id
        if @post.save

SELECT `posts`.* FROM `posts` WHERE (user_id; book LIKE '%3%' )
---
      def index
        if params[:search] == nil
          @posts= Post.all

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
UPDATE `posts` SET `posts`.`time` = '45', `posts`.`updated_at` = '2020-10-21 08:57:50.660809' WHERE `posts`.`id` = 2
---
      def update
        post = Post.find(params[:id])
        if post.update(post_params)

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 5 LIMIT 1
DELETE FROM `posts` WHERE `posts`.`id` = 5
---
      def destroy
        post = Post.find(params[:id])
        post.destroy