app/controllers/tasks_controller.rb

      def create
        @task = Task.create(task_params)
---
INSERT INTO `tasks` (`title`, `created_at`, `updated_at`) VALUES ('問題集', '2020-10-19 12:38:49.032162', '2020-10-19 12:38:49.032162')

      def edit
        @task = Task.find(params[:id])
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 1 LIMIT 1

      def destroy
        @task = Task.find(params[:id])
        @task.destroy
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 1 LIMIT 1
DELETE FROM `tasks` WHERE `tasks`.`id` = 1