app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    m0 = Post.where(created_at: Time.zone.now.beginning_of_day..Time.zone.now.end_of_day).where(user_id: @user)
    @m0 = m0.sum(:time)
    @m1 = Post.where(created_at: Time.zone.now.ago(1.days).beginning_of_day..Time.zone.now.ago(1.days).end_of_day).where(user_id: @user).sum(:time)
    @m2 = Post.where(created_at: Time.zone.now.ago(2.days).beginning_of_day..Time.zone.now.ago(2.days).end_of_day).where(user_id: @user).sum(:time)
    @m3 = Post.where(created_at: Time.zone.now.ago(3.days).beginning_of_day..Time.zone.now.ago(3.days).end_of_day).where(user_id: @user).sum(:time)
    @m4 = Post.where(created_at: Time.zone.now.ago(4.days).beginning_of_day..Time.zone.now.ago(4.days).end_of_day).where(user_id: @user).sum(:time)
    @m5 = Post.where(created_at: Time.zone.now.ago(5.days).beginning_of_day..Time.zone.now.ago(5.days).end_of_day).where(user_id: @user).sum(:time)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT SUM(`posts`.`time`) FROM `posts` WHERE `posts`.`created_at` BETWEEN '2020-10-21 00:00:00' AND '2020-10-21 23:59:59.999999' AND `posts`.`user_id` = 2
SELECT `posts`.* FROM `posts` WHERE `posts`.`created_at` BETWEEN '2020-10-16 00:00:00' AND '2020-10-16 23:59:59.999999'
SELECT SUM(`posts`.`time`) FROM `posts` WHERE `posts`.`created_at` BETWEEN '2020-10-17 00:00:00' AND '2020-10-17 23:59:59.999999' AND `posts`.`user_id` = 2
SELECT SUM(`posts`.`time`) FROM `posts` WHERE `posts`.`created_at` BETWEEN '2020-10-16 00:00:00' AND '2020-10-16 23:59:59.999999' AND `posts`.`user_id` = 2
SELECT SUM(`posts`.`time`) FROM `posts` WHERE `posts`.`created_at` BETWEEN '2020-10-15 00:00:00' AND '2020-10-15 23:59:59.999999' AND `posts`.`user_id` = 2
SELECT SUM(`posts`.`time`) FROM `posts` WHERE `posts`.`created_at` BETWEEN '2020-10-14 00:00:00' AND '2020-10-14 23:59:59.999999' AND `posts`.`user_id` = 2
SELECT SUM(`posts`.`time`) FROM `posts` WHERE `posts`.`created_at` BETWEEN '2020-10-13 00:00:00' AND '2020-10-13 23:59:59.999999' AND `posts`.`user_id` = 2
SELECT SUM(`posts`.`time`) FROM `posts` WHERE `posts`.`created_at` BETWEEN '2020-10-12 00:00:00' AND '2020-10-12 23:59:59.999999' AND `posts`.`user_id` = 2